_includes/authipay/code/card-void-minimum-example.html

&lt;?xml version="1.0" encoding="UTF-8"?&gt;
&lt;env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:v1="http://ipg-online.com/ipgapi/schemas/ipgapi" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"&gt;
  &lt;env:Body&gt;
    &lt;ipgapi:IPGApiOrderRequest
      xmlns:v1="http://ipg-online.com/ipgapi/schemas/v1"
      xmlns:ipgapi="http://ipg-online.com/ipgapi/schemas/ipgapi"&gt;
      &lt;v1:Transaction&gt;
        &lt;v1:CreditCardTxType&gt;
          &lt;v1:Type&gt;void&lt;/v1:Type&gt;
        &lt;/v1:CreditCardTxType&gt;
        &lt;v1:TransactionDetails&gt;
          &lt;v1:OrderId&gt;62e3b5df-2911-4e89-8356-1e49302b180&lt;/v1:OrderId&gt;
          &lt;v1:TDate&gt;1190244932&lt;/v1:TDate&gt;
        &lt;/v1:TransactionDetails&gt;
      &lt;/v1:Transaction&gt;
    &lt;/ipgapi:IPGApiOrderRequest&gt;
  &lt;/env:Body&gt;
&lt;/env:Envelope&gt;
